In [3]:
import pandas as pd

pd.set_option('display.max_colwidth', -1)

In [24]:
df = pd.read_csv('jeopardy.csv')

In [25]:
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
Show Number    216930 non-null int64
 Air Date      216930 non-null object
 Round         216930 non-null object
 Category      216930 non-null object
 Value         216930 non-null object
 Question      216930 non-null object
 Answer        216928 non-null object
dtypes: int64(1), object(6)
memory usage: 11.6+ MB

In [27]:
df.rename(columns={'Show Number': 'num', ' Air Date': 'date', ' Round': 'round', ' Category': 'category', ' Value': 'value', ' Question': 'question', ' Answer':'answer'}, inplace=True)

In [76]:
def filts(df_temp, question):
    return df_temp[df_temp.question.apply(lambda x : True if all(ext.lower() in x.lower() for ext in question) else False)]

In [77]:
filts(df, ["King", "England"])

,num,date,round,category,value,question,answer,value_to_float
4953,3003,1997-09-24,Double Jeopardy!,"""PH""UN WORDS",$200,"Both England's King George V & FDR put their stamp of approval on this ""King of Hobbies""",Philately (stamp collecting),200.0
6337,3517,1999-12-14,Double Jeopardy!,Y1K,$800,"In retaliation for Viking raids, this ""Unready"" king of England attacks Norse areas of the Isle of Man",Ethelred,800.0
9191,3907,2001-09-04,Double Jeopardy!,WON THE BATTLE,$800,This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt,Henry V,800.0
11710,2903,1997-03-26,Double Jeopardy!,BRITISH MONARCHS,$600,"This Scotsman, the first Stuart king of England, was called ""The Wisest Fool in Christendom""",James I,600.0
13454,4726,2005-03-07,Jeopardy!,A NUMBER FROM 1 TO 10,$1000,It's the number that followed the last king of England named William,4,1000.0
...,...,...,...,...,...,...,...,...
208295,4621,2004-10-11,Jeopardy!,THE VIKINGS,$600,In 1066 this great-great grandson of Rollo made what some call the last Viking invasion of England,William the Conqueror,600.0
208742,4863,2005-11-02,Double Jeopardy!,BEFORE & AFTER,"$3,000",Dutch-born king who ruled England jointly with Mary II & is a tasty New Zealand fish,William of Orange roughy,3.0
213870,5856,2010-02-15,Double Jeopardy!,URANUS,$1600,In 1781 William Herschel discovered Uranus & initially named it after this king of England,George III,1600.0
216021,1881,1992-11-09,Double Jeopardy!,HISTORIC NAMES,$1000,"His nickname was ""Bertie"", but he used this name & number when he became king of England in 1901",Edward VII,1000.0
216789,5070,2006-09-29,Double Jeopardy!,ANCIENT HISTORY,$1200,"This kingdom of England grew from 2 settlements, one founded around 495 by Cerdic & his son Cynric",Wessex,1200.0

In [49]:
df['value_to_float'] = df.value.apply(lambda x : float(x[1:].replace(',', '.')) if x != 'None' else 0.0)

In [50]:
df

,num,date,round,category,value,question,answer,value_to_float
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus,200.0
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe,200.0
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona,200.0
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's,200.0
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams,200.0
...,...,...,...,...,...,...,...,...
216925,4999,2006-05-11,Double Jeopardy!,RIDDLE ME THIS,$2000,This Puccini opera turns on the solution to 3 riddles posed by the heroine,Turandot,2000.0
216926,4999,2006-05-11,Double Jeopardy!,"""T"" BIRDS",$2000,"In North America this term is properly applied to only 4 species that are crested, including the tufted",a titmouse,2000.0
216927,4999,2006-05-11,Double Jeopardy!,AUTHORS IN THEIR YOUTH,$2000,"In Penny Lane, where this ""Hellraiser"" grew up, the barber shaves another customer--then flays him alive!",Clive Barker,2000.0
216928,4999,2006-05-11,Double Jeopardy!,QUOTATIONS,$2000,"From Ft. Sill, Okla. he made the plea, Arizona is my land, my home, my father's land, to which I now ask to... return""",Geronimo,2000.0
216929,4999,2006-05-11,Final Jeopardy!,HISTORIC NAMES,None,A silent movie title includes the last name of this 18th c. statesman & favorite of Catherine the Great,Grigori Alexandrovich Potemkin,0.0

In [57]:
filtered_df = filts(df, ["King"])

In [58]:
filtered_df.value_to_float.mean()

679.421748414091

In [67]:
df.answer.value_counts()

China                                           216
Australia                                       215
Japan                                           196
Chicago                                         194
France                                          193
                                               ...
Cradle                                          1
Calais (from Rodin's The Burghers of Calais)    1
Vimy Ridge                                      1
Arkansas (Wal-Mart)                             1
gold (to old)                                   1
Name: answer, Length: 88268, dtype: int64

In [69]:
df['date'] = pd.to_datetime(df['date'])

In [80]:
df_90s = df[df.date.apply(lambda x : True if (x.year >= 1900) & (x.year < 2000)  else False)]
df_20s = df[df.date.apply(lambda x : True if (x.year >= 2000) else False)]

In [79]:
filts(df_90s, ['Computer']).shape[0]

104

In [81]:
filts(df_20s, ['Computer']).shape[0]

327

In [83]:
df.groupby(['round', 'category']).num.count()

round             category
Double Jeopardy!  "-ARES"                    5
                  "...OD" WORDS              5
                  "1", "2", "3"              5
                  "20" QUESTIONS             5
                  "A" + 4                    5
                                            ..
Jeopardy!         “NORTH”                    5
                  “STREETS”                  5
Tiebreaker        CHILD'S PLAY               1
                  LITERARY CHARACTERS        1
                  THE AMERICAN REVOLUTION    1
Name: num, Length: 31686, dtype: int64